<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the Microsoft Office suite installer for Office365.</string>
    <key>Identifier</key>
    <string>com.github.scrive.download.microsoft.office.suite</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Microsoft Office</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>Process</key>
	<array>
	<dict>
		<key>Processor</key>
		<string>MicrosoftOfficeURL</string>
		<key>Arguments</key>
		<dict>
			<key>product</key>
			<string>office.suite.365</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>URLDownloader</string>
		<key>Arguments</key>
		<dict>
			<key>filename</key>
			<string>%NAME%-%version%.pkg</string>
		</dict>
	</dict>
	<dict>
		<key>Processor</key>
		<string>EndOfCheckPhase</string>
	</dict>
    </array>
</dict>
</plist>
