<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Microsoft Office and builds a package, note this version will only install Excel, PowerPoint, Word and AutoUpdater.</string>
	<key>Identifier</key>
	<string>com.github.scrive.pkg.microsoft.office.suite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Microsoft_Office</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.4</string>
	<key>ParentRecipe</key>
	<string>com.github.scrive.download.microsoft.office.suite</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>private/tmp/msoffice</key>
					<string>0777</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/pkgroot</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>pkg_path</key>
                                <string>%RECIPE_CACHE_DIR%/pkgroot/private/tmp/msoffice/Microsoft_Office_Installer.pkg</string>
                                <key>source_pkg</key>
                                <string>%pathname%</string>
                        </dict>
                        <key>Processor</key>
                        <string>PkgCopier</string>
                </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>id</key>
					<string>com.microsoft.office.suite.365</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>scripts</key>
					<string>Scripts</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>path_list</key>
                                <array>
                                        <string>%RECIPE_CACHE_DIR%/pkgroot</string>
                                </array>
                        </dict>
                        <key>Processor</key>
                        <string>PathDeleter</string>
                </dict>
	</array>
</dict>
</plist>
