<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for the Yubico YubiKey PIV tool.</string>
    <key>Identifier</key>
    <string>com.github.scrive.download.yubico.yubikey_piv_tool</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>YubiKey_PIV_Tool</string>
        <key>DOWNLOAD_URL</key>
        <string>https://developers.yubico.com/yubico-piv-tool/Releases/yubico-piv-tool-latest-mac.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>prefetch_filename</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
