<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current Yubico Authenticator installer and builds a package.</string>
	<key>Identifier</key>
	<string>com.github.scrive.pkg.yubico.yubico_authenticator</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>com.yubico.yubioath.pkg</string>
		<key>NAME</key>
		<string>YubiKey_Authenticator</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.1</string>
	<key>ParentRecipe</key>
	<string>com.github.scrive.download.yubico.yubico_authenticator</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
				<key>purge_destination</key>
				<true/>
                                <key>destination_path</key>
                                <string>%RECIPE_CACHE_DIR%/expanded_payload</string>
                                <key>pkg_payload_path</key>
                                <string>%RECIPE_CACHE_DIR%/expanded/com.yubico.yubioath.pkg/Payload</string>
                        </dict>
                        <key>Processor</key>
                        <string>PkgPayloadUnpacker</string>
                </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded_payload/Yubico Authenticator.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleShortVersionString</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
				<key>source_pkg</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>PkgCopier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>path_list</key>
				<array>
					<string>%RECIPE_CACHE_DIR%/expanded</string>
					<string>%RECIPE_CACHE_DIR%/expanded_payload</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>PathDeleter</string>
		</dict>
	</array>
</dict>
</plist>
