<?xml version="1.0" encoding="UTF-8"?>
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of 1Password and renames it with the version number.</string>
    <key>Identifier</key>
    <string>com.scrive.download.1Password</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>1Password</string>
      <key>DOWNLOAD_URL</key>
      <string>https://downloads.1password.com/mac/1Password.pkg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0</string>
    <key>Process</key>
    <array>
      <!-- Step 1: Download the pkg -->
      <dict>
        <key>Processor</key>
        <string>URLDownloader</string>
        <key>Arguments</key>
        <dict>
          <key>url</key>
          <string>%DOWNLOAD_URL%</string>
          <key>filename</key>
          <string>%NAME%.pkg</string>
        </dict>
      </dict>
      <!-- Step 2: Use custom processor to extract version -->
      <dict>
        <key>Processor</key>
        <string>com.github.scrive.autopkg/PkgDistributionVersioner</string>
        <key>Arguments</key>
        <dict>
          <key>pkg_path</key>
          <string>%pathname%</string>
        </dict>
      </dict>
      <!-- Step 3: Rename the pkg file -->
      <dict>
        <key>Processor</key>
        <string>FileMover</string>
        <key>Arguments</key>
        <dict>
          <key>source</key>
          <string>%pathname%</string>
          <key>target</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
        </dict>
      </dict>
    </array>
  </dict>
</plist>