<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.GoogleChromeUpload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Company</string>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.google.com/chrome/mac/universal/stable/GGRO/googlechrome.dmg</string>
		<key>NAME</key>
		<string>GoogleChrome</string>
	</dict>
	<key>ParentRecipe</key>
	<string>scrive.autopkg.jamf.GoogleChromeUpload</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.autopkg.download.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>b0efb8ccf082444c2e7f3774134352a3c5dbafc8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.download.recipe</string>
				<key>sha256_hash</key>
				<string>2bdc3f2e3cbdca9c01181f97f5483554a22c48cc078a9c170e57bb6fd2a4d676</string>
			</dict>
			<key>com.github.autopkg.pkg.googlechrome</key>
			<dict>
				<key>git_hash</key>
				<string>f29f399c54adee7122e9fdc3c1ea7ed4c67388a4</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.recipes/GoogleChrome/GoogleChrome.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>5acdf716353ccc57f021008bc5b4b55a5cb4e578e0f96864b71d4d2d29742ec8</string>
			</dict>
			<key>scrive.autopkg.jamf.GoogleChromeUpload</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/GoogleChromeUpload.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>57c5b77838f586b49fc3112fba8918a08211369ad39b7a834169b245cbc0b80d</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
