<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.GoogleDriveUpload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Company</string>
		<key>DOWNLOAD_URL</key>
		<string>https://dl.google.com/drive-file-stream/GoogleDrive.dmg</string>
		<key>NAME</key>
		<string>GoogleDrive</string>
	</dict>
	<key>ParentRecipe</key>
	<string>scrive.autopkg.jamf.GoogleDriveUpload</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.nstrauss.download.GoogleDrive</key>
			<dict>
				<key>git_hash</key>
				<string>db7b2e9da1d960773a91e9c3836c76b83303631d</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.nstrauss-recipes/Google Drive/GoogleDrive.download.recipe</string>
				<key>sha256_hash</key>
				<string>cc60f2e011e34913a6e884ee8b153e95eec8fd4f517e83849606204fbed561d1</string>
			</dict>
			<key>com.github.nstrauss.pkg.GoogleDrive</key>
			<dict>
				<key>git_hash</key>
				<string>8df16cab3831f51e16853bf420e26422b61dac40</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.autopkg.nstrauss-recipes/Google Drive/GoogleDrive.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>1fd7b885ac5efb2b840ac81722b9fcecda15c06a7715d5e8806e629fa0e69c08</string>
			</dict>
			<key>scrive.autopkg.jamf.GoogleDriveUpload</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/Google Drive/GoogleDriveUpload.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>968b646d99a28ccc3f9b86f912c557f6ec71d4454fb1668101104b47821fc359</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
