<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.MicrosoftWordUpload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Company</string>
		<key>NAME</key>
		<string>Microsoft_Word</string>
	</dict>
	<key>ParentRecipe</key>
	<string>scrive.autopkg.jamf.MicrosoftWordUpload</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>MicrosoftOfficeURL</key>
			<dict>
				<key>git_hash</key>
				<string>21f2131a2990725ccb6c13f0851914b7b2663506</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/MicrosoftOffice365/MicrosoftOfficeURL.py</string>
				<key>sha256_hash</key>
				<string>261ab13d89be5805a0b02d0e13fa35a7f7240a5b0f4fd9660909bb94ea09689e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.scrive.download.microsoft.office.word</key>
			<dict>
				<key>git_hash</key>
				<string>0bb558fe49fee90dc0d1fbfc557876634acb1026</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/MicrosoftOffice365/Microsoft_Word.download.recipe</string>
				<key>sha256_hash</key>
				<string>4d8f689a3d77351a27577a0d7f5934c9c557bc870c3cf4a5963ebe7113c95f8a</string>
			</dict>
			<key>com.github.scrive.pkg.microsoft.office.word</key>
			<dict>
				<key>git_hash</key>
				<string>8286f2ef6b953c82ef8cc4b0047f1128d27b93ee</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/MicrosoftOffice365/Microsoft_Word.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>6f6f4d56c0c2a5ba0497629853159821db24904d1ad0235f9c42642724ee1ef1</string>
			</dict>
			<key>scrive.autopkg.jamf.MicrosoftWordUpload</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/MicrosoftWordUpload.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>5407f22a90addff8a06f3a177a425c5d10451c309f52b63b5865dffe944a0813</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
