<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.MicrosoftTeamsUpload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Company</string>
		<key>NAME</key>
		<string>Microsoft_Teams</string>
	</dict>
	<key>ParentRecipe</key>
	<string>scrive.autopkg.jamf.MicrosoftTeamsUpload</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>MicrosoftOfficeURL</key>
			<dict>
				<key>git_hash</key>
				<string>21f2131a2990725ccb6c13f0851914b7b2663506</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/MicrosoftOffice365/MicrosoftOfficeURL.py</string>
				<key>sha256_hash</key>
				<string>261ab13d89be5805a0b02d0e13fa35a7f7240a5b0f4fd9660909bb94ea09689e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.scrive.download.microsoft.teams</key>
			<dict>
				<key>git_hash</key>
				<string>3d4b9141e91a071a3e0126999030b8cc8fc7cdcd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/MicrosoftOffice365/Microsoft_Teams.download.recipe</string>
				<key>sha256_hash</key>
				<string>b5bef5c54c3f436a3df815f30cd40191e0581053bf4526b26cc79489ffa43a74</string>
			</dict>
			<key>com.github.scrive.pkg.microsoft.teams</key>
			<dict>
				<key>git_hash</key>
				<string>3d4b9141e91a071a3e0126999030b8cc8fc7cdcd</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/MicrosoftOffice365/Microsoft_Teams.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>18857c78eb0d5116b509e39c3ec558b0845822f4e02a9714e86ecdb4f1585f7e</string>
			</dict>
			<key>scrive.autopkg.jamf.MicrosoftTeamsUpload</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/MicrosoftTeamsUpload.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>3c6aa019727f0343f81e6f0df00c40561f12cf03672d64f1324c975cb5e8289e</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
