<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.SlackUpload</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Company</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
		<key>DOWNLOAD_URL</key>
		<string>https://slack.com/ssb/download-osx</string>
		<key>NAME</key>
		<string>Slack</string>
		<key>PKG_ID</key>
		<string>com.tinyspeck.slackmacgap</string>
	</dict>
	<key>ParentRecipe</key>
	<string>scrive.autopkg.jamf.SlackUpload</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.scrive.download.slack</key>
			<dict>
				<key>git_hash</key>
				<string>db97fb9f32788ee9e77c6ab88d8b30e094474e31</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/Slack/Slack.download.recipe</string>
				<key>sha256_hash</key>
				<string>58f7fad5ff971f5372ba65e91e930215001dc68b90253d6878075352b41f59ec</string>
			</dict>
			<key>com.github.scrive.pkg.slack</key>
			<dict>
				<key>git_hash</key>
				<string>db97fb9f32788ee9e77c6ab88d8b30e094474e31</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/Slack/Slack.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>f559b51f7b857bc8c77b43a5b221f7c2363d999b59df8d1f361e4a156695fd32</string>
			</dict>
			<key>scrive.autopkg.jamf.SlackUpload</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/SlackUpload.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>46589911b929b6769200ff598521b2faa114fc263b2bb316c8ca937e203bd09b</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
