<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>local.jamf.ZoomUpload</string>
	<key>Input</key>
	<dict>
		<key>BUNDLE_ID</key>
		<string>us.zoom.xos</string>
		<key>CATEGORY</key>
		<string>Company</string>
		<key>DOWNLOAD_URL</key>
		<string>https://zoom.us/client/latest/ZoomInstallerIT.pkg</string>
		<key>NAME</key>
		<string>Zoom</string>
	</dict>
	<key>ParentRecipe</key>
	<string>scrive.autopkg.jamf.ZoomUpload</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfCategoryUploader.py</string>
				<key>sha256_hash</key>
				<string>04c8db5b4863bfae7d3e56700ac2a0ac64030826541249be9a0e300f6ff6ee3e</string>
			</dict>
			<key>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</key>
			<dict>
				<key>git_hash</key>
				<string>97bfc50b9269c6fbd76f8f7758fc2f0aa00d5bf8</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.grahampugh.jamf-upload/JamfUploaderProcessors/JamfPackageUploader.py</string>
				<key>sha256_hash</key>
				<string>0ca85d733b101e1b48b0e8fb67aff136d50ca347bf3b951238809e3a20120f95</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.scrive.download.zoomforit</key>
			<dict>
				<key>git_hash</key>
				<string>9289251f332882983b50e3336414f7ca670cf8b5</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/Zoom/Zoom.download.recipe</string>
				<key>sha256_hash</key>
				<string>73dda4495859e6491f75e42b9ec4dab1f12db3704e4650354e361d1b699b9dbb</string>
			</dict>
			<key>com.github.scrive.pkg.zoomforit</key>
			<dict>
				<key>git_hash</key>
				<string>56cc03e871456db9ed7c39ce2ef70d6806f03f43</string>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/Zoom/Zoom.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>4a9b6dd7000357047cab193b4d6fb91fc208ea52ec58c095e2810ca76f444fbf</string>
			</dict>
			<key>scrive.autopkg.jamf.ZoomUpload</key>
			<dict>
				<key>path</key>
				<string>~/Library/AutoPkg/RecipeRepos/com.github.scrive.autopkg/ZoomUpload.jamf.recipe</string>
				<key>sha256_hash</key>
				<string>35bd952a5cca66dd5a655fc830e79c992681e5f8d552aa8a67ee024b6347cb94</string>
			</dict>
		</dict>
	</dict>
</dict>
</plist>
